     H
     D Str             S              5A
     D Number          S              5S 0
     C     'Start'       DSPLY
     C                   EVAL      Number = 99
     C                   EVAL      Str = 'Hi'
     C     Number        DSPLY
     C     Str           DSPLy
     C                   EVAL      *inlr = *On
